docker/service/src/integration-test/resources/responses/MCCI_IN010000UK13.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns="urn:hl7-org:v3">
    <SOAP-ENV:Header>
        <wsa:MessageID>uuid:6B29FC40-CA47-1067-B31D-00DD010662DA</wsa:MessageID>
        <wsa:Action>urn:nhs:names:services:lrs/MCCI_IN010000UK13 </wsa:Action>
        <wsa:To>https://synch.nis1.national.ncrs.nhs.uk/syncservice/tms</wsa:To>
        <wsa:From>
            <wsa:Address>http://myMSH.com/pds/myPage.asmx</wsa:Address>
        </wsa:From>
        <communicationFunctionRcv>
            <device>
                <id root="1.2.826.0.1285.0.2.0.107" extension="ZZZ999-100000000900001"/>
            </device>
        </communicationFunctionRcv>
        <communicationFunctionSnd>
            <device>
                <id root="1.2.826.0.1285.0.2.0.107" extension="ZZZ000-100000000800001"/>
            </device>
        </communicationFunctionSnd>
        <wsa:ReplyTo>
            <wsa:Address>http://myMSH.com/pds/myPage.asmx</wsa:Address>
        </wsa:ReplyTo>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
      <MCCI_IN010000UK13 xmlns="urn:hl7-org:v3" type="Message">
        <id root="BBBBP10A-A9D1-A411-F824-9F7A00A33757"/>
        <creationTime value="200401061130"/>
        <versionCode code="V3NPfIT3.1.08"/>
        <interactionId root="2.16.840.1.113883.2.1.3.2.4.12" extension="MCCI_IN010000UK13"/>
        <processingCode code="P"/>
        <processingModeCode code="T"/>
        <acceptAckCode code="NE"/>
        <acknowledgement typeCode="AE" type="Acknowledgement">
          <messageRef type="Message">
            <id root="11111111-65D3-EC42-BC31-62522532BC5D"/>
          </messageRef>
        </acknowledgement>
        <communicationFunctionRcv typeCode="RCV" type="CommunicationFunction">
          <device type="Device" classCode="DEV" determinerCode="INSTANCE">
            <id root="1.2.826.0.1285.0.2.0.107" extension="ZZZ999-100000000900001"/>
          </device>
        </communicationFunctionRcv>
        <communicationFunctionSnd typeCode="SND" type="CommunicationFunction">
          <device type="Device" classCode="DEV" determinerCode="INSTANCE">
            <id root="1.2.826.0.1285.0.2.0.107" extension="ZZZ000-100000000800001"/>
          </device>
        </communicationFunctionSnd>
        <ControlActEvent classCode="CACT" moodCode="EVN" type="ControlAct">
          <author1 typeCode="AUT" type="Participation">
            <AgentSystemSDS classCode="AGNT" type="RoleHeir">
              <agentSystemSDS classCode="DEV" determinerCode="INSTANCE" type="Device">
                <id root="1.2.826.0.1285.0.2.0.107" extension="accredited system id"/>
              </agentSystemSDS>
            </AgentSystemSDS>
          </author1>
          <reason typeCode="RSON" type="ActRelationship">
            <justifyingDetectedIssueEvent classCode="ALRT" moodCode="EVN" type="Observation">
              <code code="0" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.42">
                <qualifier inverted="false">
                  <value code="ER" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.104"/>
                </qualifier>
              </code>
            </justifyingDetectedIssueEvent>
          </reason>
        </ControlActEvent>
      </MCCI_IN010000UK13>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
